package day03;

public class homework {

	public static void main(String[] args) {
		/* 1.
		 * 아래와 같이 출력되도록 코드를 작성해보세요.
		 * 단, printf() 메소드를 이용하여 작성하세요. 
		 * 
		 * 출력결과
		    제 이름은 조병호입니다.
		   제 키는 180cm 이고,
		   제 몸무게는 62.35kg 입니다.
		 */

		/* 2.
		 * 아래와 같이 이름과 나이를 한줄에 입력받아 아래와 같이 출력해보세요.
		 * 단, 입력받을 경우 "홍길동 31"과 같이 중간의 공백을 기준으로 합니다.
		 * 즉, 이름과 나이 사이의 공백을 기준으로 2개의 값을 입력받으세요
		 * hint) 
		 * 첫번째 입력받은 값은 String 문자열 변수를 이용하여 저장하고
		 * 두번째 입력받은 값은 int 정수 변수를 이용하여 저장한다.
		 * 
		 * 입/출력 결과
		    입력받기 : 본인의 이름과 나이를 입력하세요(예: 홍길동 31) : 조병호 30
		   출력결과 : 제 이름은 조병호이고, 나이는 30살 입니다.
		 */
	}
}
