package day07;

public class Homework {
	public static void main(String[] args) {
		/* 1.
		 * { 10, 50, 30 } 이런식으로 초기화한 배열에서 가장큰 수 찾아내기
		 * 3개의 값 중에서 가장 큰 수를 찾아내는 알고리즘
		 * 
		 * 가장 큰 수는 50입니다.
		 */

		/* 2.
		 * { 10, 50, 30, 4, 100 } 이런식으로 초기화한 배열에서 
		 * 가장큰 수와 가장 작은 수 찾아내기
		 * 큰 수와 작은 수 찾기 알고리즘 문제
		 * 
		 * 가장 큰 수는 100이고, 가장 작은수는 4입니다.
		 */

		/* 3.
		 * ===== 주문 메뉴 =====
		 * 1. 햄버거 2000원
		 * 2. 감자튀김 500원
		 * 3. 콜라 1000원
		 * 4. 주문하기 
		 * 
		 * 을 배열로 생성하여 출력하고.
		 * 해당 메뉴를 사용자가 선택하면 배열에 저장하여
		 * 4. 주문하기 선택시 계산하여 주문 금액을 출력한다.
		 *  
		 * 주문 메뉴를 선택하세요 : 1
		 * 		주문 메뉴 출력 ....
		 * 주문 메뉴를 선택하세요 : 2
		 * 		주문 메뉴 출력 ....
		 * 
		 * 단, 최대 주문 받을수 있는 횟수는 5회 까지로 한다.
		 * 
		 * 총 결제 금액은 XXX 원입니다.
		 */


	}
}
